<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [142]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [143]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.22.3
Pandas:  1.4.2

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [144]:
# wrong:
#bikes = pd.read_table('dat/bikeshare.csv', header = None)
#print(bikes.head())
#print()

# wrong:
#bikes = pd.read_table('dat/bikeshare.csv', header = 1)
#print(bikes.head())
#print()

# wrong:
#bikes = pd.read_table('dat/bikeshare.csv', header = 0)
#print(bikes.head())

?:
ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [145]:
#ANSWER:
bikes = pd.read_csv('D:/IOD/Data/Datasets 1/bikeshare.csv')
bikes.head()
bikes.columns
bikes.values
bikes.index
bikes.shape
bikes.describe()

          instant        season            yr          mnth            hr       holiday       weekday    workingday    weathersit          temp         atemp           hum     windspeed        casual    registered           cnt
count  17379.0000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000  17379.000000
mean    8690.0000      2.501640      0.502561      6.537775     11.546752      0.028770      3.003683      0.682721      1.425283      0.496987      0.475775      0.627229      0.190098     35.676218    153.786869    189.463088
std     5017.0295      1.106918      0.500008      3.438776      6.914405      0.167165      2.005771      0.465431      0.639357      0.192556      0.171850      0.192930      0.122340     49.305030    151.357286    181.387599
min        1.0000      1.000000      0.000000      1.000000      0.000000      0.000000      0.000000      0.000000      1.000000      0.020000      0.000000      0.000000      0.000000      0.000000      0.000000      1.000000
25%     4345.5000      2.000000      0.000000      4.000000      6.000000      0.000000      1.000000      0.000000      1.000000      0.340000      0.333300      0.480000      0.104500      4.000000     34.000000     40.000000
50%     8690.0000      3.000000      1.000000      7.000000     12.000000      0.000000      3.000000      1.000000      1.000000      0.500000      0.484800      0.630000      0.194000     17.000000    115.000000    142.000000
75%    13034.5000      3.000000      1.000000     10.000000     18.000000      0.000000      5.000000      1.000000      2.000000      0.660000      0.621200      0.780000      0.253700     48.000000    220.000000    281.000000
max    17379.0000      4.000000      1.000000     12.000000     23.000000      1.000000      6.000000      1.000000      4.000000      1.000000      1.000000      1.000000      0.850700    367.000000    886.000000    977.000000

In [146]:
bikes.columns  
len(bikes.columns)
bikes.instant.nunique() # to identify the instant is the index column
bikes.instant.unique()

array([    1,     2,     3, ..., 17377, 17378, 17379], dtype=int64)

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [147]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [148]:
pd.set_option('expand_frame_repr', False)
df = pd.read_excel('D:/IOD/Data/Datasets 1/Iris.xlsx', sheet_name = 'Data')
print(df)

     Species_No  Petal_width  Petal_length  Sepal_width  Sepal_length Species_name
0           1.0          0.2           1.4          3.5           5.1       Setosa
1           1.0          0.2           1.4          3.0           4.9       Setosa
2           1.0          0.2           1.3          3.2           4.7       Setosa
3           1.0          0.2           1.5          3.1           4.6       Setosa
4           1.0          0.2           1.4          3.6           5.0       Setosa
..          ...          ...           ...          ...           ...          ...
145         3.0          2.3           5.2          3.0           6.7    Verginica
146         3.0          1.9           5.0          2.5           6.3    Verginica
147         3.0          2.0           5.2          3.0           6.5    Verginica
148         3.0          2.3           5.4          3.4           6.2    Verginica
149         3.0          1.8           5.1          3.0           5.9    Verginica

[150 rows x 6 columns]

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For ecxample, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [149]:
del df['Species_name']
print(df)
#solution: df = pd.read_excel('../../../DATA/Iris.xls', sheet_name = 'Data', header = 0, usecols = [0, 1, 2, 3, 4])

     Species_No  Petal_width  Petal_length  Sepal_width  Sepal_length
0           1.0          0.2           1.4          3.5           5.1
1           1.0          0.2           1.4          3.0           4.9
2           1.0          0.2           1.3          3.2           4.7
3           1.0          0.2           1.5          3.1           4.6
4           1.0          0.2           1.4          3.6           5.0
..          ...          ...           ...          ...           ...
145         3.0          2.3           5.2          3.0           6.7
146         3.0          1.9           5.0          2.5           6.3
147         3.0          2.0           5.2          3.0           6.5
148         3.0          2.3           5.4          3.4           6.2
149         3.0          1.8           5.1          3.0           5.9

[150 rows x 5 columns]

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [150]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

                       time   latitude  longitude   depth   mag magType   nst  gap   dmin   rms  ...                   updated                                place        type horizontalError depthError  magError  magNst    status  locationSource magSource
0  2022-06-05T05:09:53.606Z -21.071200  -178.5835  532.43  4.30      mb   NaN  104  4.585  0.76  ...  2022-06-05T05:31:43.040Z                          Fiji region  earthquake           12.90       6.40     0.058      84  reviewed              us        us
1  2022-06-05T05:06:06.450Z  18.085167   -66.1100   23.54  2.95      md  10.0  119    NaN  0.19  ...  2022-06-05T05:19:32.500Z  4 km S of G. L. Garcia, Puerto Rico  earthquake            0.64       0.65     0.233       9  reviewed              pr        pr

[2 rows x 22 columns]

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [151]:
url = 'https://www.ccra.com/airport-codes/'

df = pd.read_html(url)
df

[                City      Country Code
 0            Aalborg      Denmark  AAL
 1           Aalesund       Norway  AES
 2             Aarhus      Denmark  AAR
 3     Abbotsford, BC       Canada  YXX
 4     Abbotsford, BC       Canada  YXX
 ...              ...          ...  ...
 1574        Zanzibar     Tanzania  ZNZ
 1575        Zaragoza        Spain  ZAZ
 1576       Zhengzhou        China  CGO
 1577        Zhoushan        China  HSN
 1578          Zurich  Switzerland  ZRH

 [1579 rows x 3 columns]]

In [152]:
df[0]

                City      Country Code
0            Aalborg      Denmark  AAL
1           Aalesund       Norway  AES
2             Aarhus      Denmark  AAR
3     Abbotsford, BC       Canada  YXX
4     Abbotsford, BC       Canada  YXX
...              ...          ...  ...
1574        Zanzibar     Tanzania  ZNZ
1575        Zaragoza        Spain  ZAZ
1576       Zhengzhou        China  CGO
1577        Zhoushan        China  HSN
1578          Zurich  Switzerland  ZRH

[1579 rows x 3 columns]

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [153]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [154]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [155]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [156]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [157]:
#ANSWER
bikes.head()   #solutions:bikes.index

   instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0        1  2011-01-01       1   0     1   0        0        6           0           1  0.24  0.2879  0.81        0.0       3          13   16
1        2  2011-01-01       1   0     1   1        0        6           0           1  0.22  0.2727  0.80        0.0       8          32   40
2        3  2011-01-01       1   0     1   2        0        6           0           1  0.22  0.2727  0.80        0.0       5          27   32
3        4  2011-01-01       1   0     1   3        0        6           0           1  0.24  0.2879  0.75        0.0       3          10   13
4        5  2011-01-01       1   0     1   4        0        6           0           1  0.24  0.2879  0.75        0.0       0           1    1

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [158]:
#ANSWER
print(bikes)
bikes['season']   # series

       instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0            1  2011-01-01       1   0     1   0        0        6           0           1  0.24  0.2879  0.81     0.0000       3          13   16
1            2  2011-01-01       1   0     1   1        0        6           0           1  0.22  0.2727  0.80     0.0000       8          32   40
2            3  2011-01-01       1   0     1   2        0        6           0           1  0.22  0.2727  0.80     0.0000       5          27   32
3            4  2011-01-01       1   0     1   3        0        6           0           1  0.24  0.2879  0.75     0.0000       3          10   13
4            5  2011-01-01       1   0     1   4        0        6           0           1  0.24  0.2879  0.75     0.0000       0           1    1
...        ...         ...     ...  ..   ...  ..      ...      ...         ...         ...   ...     ...   ...        ...     ...         ...  ...
17374    17375  2012-12-31       1   1    12  19        0        1           1           2  0.26  0.2576  0.60     0.1642      11         108  119
17375    17376  2012-12-31       1   1    12  20        0        1           1           2  0.26  0.2576  0.60     0.1642       8          81   89
17376    17377  2012-12-31       1   1    12  21        0        1           1           1  0.26  0.2576  0.60     0.1642       7          83   90
17377    17378  2012-12-31       1   1    12  22        0        1           1           1  0.26  0.2727  0.56     0.1343      13          48   61
17378    17379  2012-12-31       1   1    12  23        0        1           1           1  0.26  0.2727  0.65     0.1343      12          37   49

[17379 rows x 17 columns]

0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64

In [159]:
bikes[['season']]   #dataframe

       season
0           1
1           1
2           1
3           1
4           1
...       ...
17374       1
17375       1
17376       1
17377       1
17378       1

[17379 rows x 1 columns]

How would we use object notation to show the first 4 rows of `atemp`?

In [160]:
#ANSWER
bikes['atemp'] [:4]

0    0.2879
1    0.2727
2    0.2727
3    0.2879
Name: atemp, dtype: float64

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [161]:
#bikes[[0]]
#E: bikes[0]
#E: bikes[0,0]
#E: bikes[[0,0]]

What is the correct way to access the 1st row of the DataFrame by its index?

In [162]:
#ANSWER
bikes.iloc[0:1]
#solution:   bikes[:1]

   instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0        1  2011-01-01       1   0     1   0        0        6           0           1  0.24  0.2879  0.81        0.0       3          13   16

What is the correct way to access the 2nd column of the DataFrame by its index?

In [163]:
#ANSWER
bikes.iloc[:,1:2]
# solution    bikes.iloc[:, 1]

           dteday
0      2011-01-01
1      2011-01-01
2      2011-01-01
3      2011-01-01
4      2011-01-01
...           ...
17374  2012-12-31
17375  2012-12-31
17376  2012-12-31
17377  2012-12-31
17378  2012-12-31

[17379 rows x 1 columns]

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER:

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [164]:
bikes.isnull().head()

   instant  dteday  season     yr   mnth     hr  holiday  weekday  workingday  weathersit   temp  atemp    hum  windspeed  casual  registered    cnt
0    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
1    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
2    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
3    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
4    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [165]:
#ANSWER
bikes.isnull()

       instant  dteday  season     yr   mnth     hr  holiday  weekday  workingday  weathersit   temp  atemp    hum  windspeed  casual  registered    cnt
0        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
1        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
2        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
3        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
4        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
...        ...     ...     ...    ...    ...    ...      ...      ...         ...         ...    ...    ...    ...        ...     ...         ...    ...
17374    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17375    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17376    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17377    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17378    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False

[17379 rows x 17 columns]

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [166]:
#ANSWER
bikes.isna()

       instant  dteday  season     yr   mnth     hr  holiday  weekday  workingday  weathersit   temp  atemp    hum  windspeed  casual  registered    cnt
0        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
1        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
2        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
3        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
4        False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
...        ...     ...     ...    ...    ...    ...      ...      ...         ...         ...    ...    ...    ...        ...     ...         ...    ...
17374    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17375    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17376    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17377    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False
17378    False   False   False  False  False  False    False    False       False       False  False  False  False      False   False       False  False

[17379 rows x 17 columns]

In [167]:
bikes.notna()

       instant  dteday  season    yr  mnth    hr  holiday  weekday  workingday  weathersit  temp  atemp   hum  windspeed  casual  registered   cnt
0         True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
1         True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
2         True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
3         True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
4         True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
...        ...     ...     ...   ...   ...   ...      ...      ...         ...         ...   ...    ...   ...        ...     ...         ...   ...
17374     True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
17375     True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
17376     True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
17377     True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True
17378     True    True    True  True  True  True     True     True        True        True  True   True  True       True    True        True  True

[17379 rows x 17 columns]

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER: Marking a data point as invalid.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [168]:
#ANSWER
def divide(dividend, divisor):
    if divisor == 0:
        quotient = np.nan
    else:
        quotient = dividend / divisor
    return (quotient)

print(divide(1, 0))

nan

Apply the Pandas `isna` function to the following data objects:

In [169]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [170]:
#ANSWER
array_0 = np.array([[x],[y]])
array_0
df_0 = pd.DataFrame(array_0)
print(array_0)
print(divide(x,y))

[[2.3]
 [nan]]
nan

In [171]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [172]:
#ANSWER
df_test = pd.DataFrame(array)
df_test.isna()

       0      1      2
0  False   True  False
1  False  False   True

How is the pandas I/O parameter `na_values` used?

In [173]:
# used for replacing na values

? ANSWER:

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [174]:
#ANSWER
bikes.season.nunique()   # 4 seasons
# solutions:   bikes['season'].value_counts()

4

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [175]:
#ANSWER
print(bikes[['instant','dteday','windspeed']])

# solutions:
print('instant:', bikes['instant'].min(), 'to', bikes['instant'].max())
print('dteday:', bikes['dteday'].min(), 'to', bikes['dteday'].max())
print('windspeed:', bikes['windspeed'].min(), 'to', bikes['windspeed'].max())

       instant      dteday  windspeed
0            1  2011-01-01     0.0000
1            2  2011-01-01     0.0000
2            3  2011-01-01     0.0000
3            4  2011-01-01     0.0000
4            5  2011-01-01     0.0000
...        ...         ...        ...
17374    17375  2012-12-31     0.1642
17375    17376  2012-12-31     0.1642
17376    17377  2012-12-31     0.1642
17377    17378  2012-12-31     0.1343
17378    17379  2012-12-31     0.1343

[17379 rows x 3 columns]
instant: 1 to 17379
dteday: 2011-01-01 to 2012-12-31
windspeed: 0.0 to 0.8507

Compute and print the overall minimum and maximum of the numeric data columns:

In [176]:
print('minimum of numeric data columns',bikes.min())
print('maxium of numeric data columns',bikes.max())

"""solutions:
bikes_min, bikes_max = (min(bikes.min(numeric_only=True)), 
                        max(bikes.max(numeric_only=True)))
bikes_min, bikes_max"""

minimum of numeric data columns instant                1
dteday        2011-01-01
season                 1
yr                     0
mnth                   1
hr                     0
holiday                0
weekday                0
workingday             0
weathersit             1
temp                0.02
atemp                0.0
hum                  0.0
windspeed            0.0
casual                 0
registered             0
cnt                    1
dtype: object
maxium of numeric data columns instant            17379
dteday        2012-12-31
season                 4
yr                     1
mnth                  12
hr                    23
holiday                1
weekday                6
workingday             1
weathersit             4
temp                 1.0
atemp                1.0
hum                  1.0
windspeed         0.8507
casual               367
registered           886
cnt                  977
dtype: object

'solutions:\nbikes_min, bikes_max = (min(bikes.min(numeric_only=True)), \n                        max(bikes.max(numeric_only=True)))\nbikes_min, bikes_max'

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [177]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [178]:
#ANSWER
bikes['atemp'].quantile([0.1,0.25,0.5,0.75,0.9])

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [179]:
type(bikes['atemp'])

pandas.core.series.Series

In [180]:
bikes.sample(5)

       instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
16534    16535  2012-11-26       4   1    11  16        0        1           1           1  0.44  0.4394  0.30     0.0000      49         297  346
14519    14520  2012-09-02       3   1     9   4        0        0           0           1  0.66  0.5909  0.89     0.0000       7          15   22
2930      2931  2011-05-07       2   0     5   0        0        6           0           1  0.42  0.4242  0.82     0.1343      10          76   86
14782    14783  2012-09-13       3   1     9   3        0        4           1           1  0.52  0.5000  0.83     0.0000       2           9   11
15008    15009  2012-09-22       3   1     9  13        0        6           0           1  0.74  0.6667  0.51     0.3582     273         434  707

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [181]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)

What is `atemp_level`?

In [182]:
#ANSWER
atemp_level

0        (0.25, 0.5]
1        (0.25, 0.5]
2        (0.25, 0.5]
3        (0.25, 0.5]
4        (0.25, 0.5]
            ...
17374    (0.25, 0.5]
17375    (0.25, 0.5]
17376    (0.25, 0.5]
17377    (0.25, 0.5]
17378    (0.25, 0.5]
Name: atemp, Length: 17379, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

Here is a random sample of `atemp_level`:

In [183]:
atemp_level.sample(5)

1888     (0.25, 0.5]
7164     (0.25, 0.5]
14999    (0.5, 0.75]
15858    (0.25, 0.5]
6997     (0.25, 0.5]
Name: atemp, dtype: category
Categories (4, interval[float64, right]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [184]:
atemp_level = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

13893    warm
5535     warm
15869    mild
208      cool
12685    warm
Name: atemp, dtype: category
Categories (4, object): ['cool' < 'mild' < 'warm' < 'hot']

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [185]:
#ANSWER  check easier way

pd.set_option('expand_frame_repr', False)
bikes['atemp_level']=atemp_level
season_list=[2]
atemp_list=['mild']
bikes_filter1= bikes['season'].isin(season_list)
#print(bikes_filter1)
bikes_filtered1 =bikes.loc[bikes_filter1]
#print(bikes_filtered1)
bikes_fileter2 =bikes_filtered1['atemp_level'].isin(atemp_list)
#print(bikes_fileter2)
bikes_filtered2 = bikes_filtered1.loc[bikes_fileter2]
bikes_filtered2
#bikes['atemp_level']=atemp_level
#bikes.groupby(['season'])['atemp'].count()

       instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  weathersit  temp  atemp   hum  windspeed  casual  registered  cnt atemp_level
1807      1808  2011-03-21       2   0     3   0        0        1           1           3  0.34  0.303  0.66     0.3881       2          11   13        mild
1808      1809  2011-03-21       2   0     3   1        0        1           1           2  0.34  0.303  0.71     0.3881       1           6    7        mild
1809      1810  2011-03-21       2   0     3   2        0        1           1           2  0.34  0.303  0.71     0.3284       1           5    6        mild
1810      1811  2011-03-21       2   0     3   3        0        1           1           2  0.34  0.303  0.71     0.3284       0           1    1        mild
1811      1812  2011-03-21       2   0     3   5        0        1           1           1  0.32  0.303  0.81     0.2985       1           1    2        mild
...        ...         ...     ...  ..   ...  ..      ...      ...         ...         ...   ...    ...   ...        ...     ...         ...  ...         ...
12674    12675  2012-06-17       2   1     6   7        0        0           0           1  0.52  0.500  0.72     0.0896      18          30   48        mild
12694    12695  2012-06-18       2   1     6   3        0        1           1           2  0.52  0.500  0.83     0.2239       1           3    4        mild
12696    12697  2012-06-18       2   1     6   5        0        1           1           3  0.52  0.500  0.83     0.1343       1          22   23        mild
12697    12698  2012-06-18       2   1     6   6        0        1           1           3  0.52  0.500  0.88     0.1343       0          37   37        mild
12698    12699  2012-06-18       2   1     6   7        0        1           1           3  0.52  0.500  0.94     0.2239      10         135  145        mild

[1829 rows x 18 columns]

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [186]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )
print('a',a, type(a))  
print('b',b, type(b)) 
print('c',c, type(c)) 
print('d',d, type(d)) 
print('e',e, type(e))

a [0. 0. 0.] <class 'numpy.ndarray'>
b [[1. 1. 1.]] <class 'numpy.ndarray'>
c [[[7 4 6 7]
  [8 1 1 5]
  [5 6 5 6]]

 [[4 2 3 3]
  [8 3 8 1]
  [6 5 4 1]]] <class 'numpy.ndarray'>
d [0 1 2 3] <class 'numpy.ndarray'>
e [[1 2 3 4]
 [5 6 7 8]] <class 'numpy.ndarray'>

In [187]:
# Cleaning Data

## Load Data

Load rock.csv and clean the dataset.

In [219]:
path = r'D:\IOD\Data\Datasets 2\rock.csv'
rock = pd.read_csv(path)
rock

                                       Song Clean ARTIST CLEAN Release Year                                           COMBINED  First?  Year?  PlayCount  F*G
0                                Caught Up in You  .38 Special         1982                    Caught Up in You by .38 Special       1      1         82   82
1                                    Fantasy Girl  .38 Special          NaN                        Fantasy Girl by .38 Special       1      0          3    0
2                                 Hold On Loosely  .38 Special         1981                     Hold On Loosely by .38 Special       1      1         85   85
3                          Rockin' Into the Night  .38 Special         1980              Rockin' Into the Night by .38 Special       1      1         18   18
4                               Art For Arts Sake         10cc         1975                          Art For Arts Sake by 10cc       1      1          1    1
...                                           ...          ...          ...                                                ...     ...    ...        ...  ...
2225                      She Loves My Automobile       ZZ Top          NaN                  She Loves My Automobile by ZZ Top       1      0          1    0
2226                            Tube Snake Boogie       ZZ Top         1981                        Tube Snake Boogie by ZZ Top       1      1         32   32
2227                                         Tush       ZZ Top         1975                                     Tush by ZZ Top       1      1        109  109
2228                                   TV Dinners       ZZ Top         1983                               TV Dinners by ZZ Top       1      1          1    1
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO       ZZ Top         1973  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...       1      1          2    2

[2230 rows x 8 columns]

## Check Column Names

Check column names and clean.

In [220]:
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

In [221]:
def clean_column_name(column_names):
    clean_column_names = []
    for c in column_names:
        c = c.lower().replace(' ', '_')
        c = c.lower().replace('*', '')
        c = c.lower().replace('?', '')
        clean_column_names.append(c)
        
    return clean_column_names
rock.columns = clean_column_name(rock.columns)
rock

                                       song_clean artist_clean release_year                                           combined  first  year  playcount   fg
0                                Caught Up in You  .38 Special         1982                    Caught Up in You by .38 Special      1     1         82   82
1                                    Fantasy Girl  .38 Special          NaN                        Fantasy Girl by .38 Special      1     0          3    0
2                                 Hold On Loosely  .38 Special         1981                     Hold On Loosely by .38 Special      1     1         85   85
3                          Rockin' Into the Night  .38 Special         1980              Rockin' Into the Night by .38 Special      1     1         18   18
4                               Art For Arts Sake         10cc         1975                          Art For Arts Sake by 10cc      1     1          1    1
...                                           ...          ...          ...                                                ...    ...   ...        ...  ...
2225                      She Loves My Automobile       ZZ Top          NaN                  She Loves My Automobile by ZZ Top      1     0          1    0
2226                            Tube Snake Boogie       ZZ Top         1981                        Tube Snake Boogie by ZZ Top      1     1         32   32
2227                                         Tush       ZZ Top         1975                                     Tush by ZZ Top      1     1        109  109
2228                                   TV Dinners       ZZ Top         1983                               TV Dinners by ZZ Top      1     1          1    1
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO       ZZ Top         1973  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...      1     1          2    2

[2230 rows x 8 columns]

## Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [222]:
rock.isna().sum()

song_clean        0
artist_clean      0
release_year    577
combined          0
first             0
year              0
playcount         0
fg                0
dtype: int64

In [223]:
rock = rock.fillna(0)
# solution: Create a mask to find all rows with null values
#null_mask = rock['release_year'].isnull()
#rock.loc[null_mask, 'release_year'] = 0

## Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [224]:
rock.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

In [225]:
#rock['Release Year'] = pd.to_numeric(rock['Release Year'])
# line1504, Bullfrog blues release year is 1967(source google)
rock.loc[rock.index==1504,'release_year'] =1967


#solutions: song_facts_mask = rock['release_year'] == 'SONGFACTS.COM'
#rock.loc[song_facts_mask, 'release_year'] = np.NaN

In [226]:
rock.iloc[1499:1510]

                                             song_clean    artist_clean release_year                                           combined  first  year  playcount  fg
1499                                Waiting on a Friend  Rolling Stones         1981              Waiting on a Friend by Rolling Stones      1     1          3   3
1500                                        Wild Horses  Rolling Stones         1971                      Wild Horses by Rolling Stones      1     1          5   5
1501                 You Can't Always Get What You Want  Rolling Stones         1969  You Can't Always Get What You Want by Rolling ...      1     1         62  62
1502                                 YOU GOT THE SILVER  Rolling Stones         1969               YOU GOT THE SILVER by Rolling Stones      1     1          1   1
1503                                     YOU GOTTA MOVE  Rolling Stones         1971                   YOU GOTTA MOVE by Rolling Stones      1     1          1   1
1504                                     Bullfrog Blues  Rory Gallagher         1967                   Bullfrog Blues by Rory Gallagher      1     1          1   1
1505                                         Cry Sister     Royal Bliss            0                          Cry Sister by Royal Bliss      1     0          6   0
1506  2112: Overture / The Temples of Syrinx (Chroni...            Rush         1976  2112: Overture / The Temples of Syrinx (Chroni...      1     1          2   2
1507                                Closer to the Heart            Rush         1977                        Closer to the Heart by Rush      1     1         31  31
1508                                         Entre Nous            Rush         1980                                 Entre Nous by Rush      1     1          2   2
1509                                     Finding My Way            Rush            0                             Finding My Way by Rush      1     0          1   0

In [227]:
rock['release_year'] = pd.to_numeric(rock['release_year'])
#rock['Release Year'].fillna(0,inplace=True).astype(np.int64)
#rock.fillna(0)
#rock['Release Year'].astype(np.int64)
rock.dtypes
#rock.fillna(0)

song_clean      object
artist_clean    object
release_year     int64
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [228]:
def check_min_max(df):
    # Check min, max of each column
    print(df.describe().T[['min', 'max']])
check_min_max(rock)
rock

              min     max
release_year  0.0  2014.0
first         1.0     1.0
year          0.0     1.0
playcount     0.0   142.0
fg            0.0   142.0

                                       song_clean artist_clean  release_year                                           combined  first  year  playcount   fg
0                                Caught Up in You  .38 Special          1982                    Caught Up in You by .38 Special      1     1         82   82
1                                    Fantasy Girl  .38 Special             0                        Fantasy Girl by .38 Special      1     0          3    0
2                                 Hold On Loosely  .38 Special          1981                     Hold On Loosely by .38 Special      1     1         85   85
3                          Rockin' Into the Night  .38 Special          1980              Rockin' Into the Night by .38 Special      1     1         18   18
4                               Art For Arts Sake         10cc          1975                          Art For Arts Sake by 10cc      1     1          1    1
...                                           ...          ...           ...                                                ...    ...   ...        ...  ...
2225                      She Loves My Automobile       ZZ Top             0                  She Loves My Automobile by ZZ Top      1     0          1    0
2226                            Tube Snake Boogie       ZZ Top          1981                        Tube Snake Boogie by ZZ Top      1     1         32   32
2227                                         Tush       ZZ Top          1975                                     Tush by ZZ Top      1     1        109  109
2228                                   TV Dinners       ZZ Top          1983                               TV Dinners by ZZ Top      1     1          1    1
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO       ZZ Top          1973  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...      1     1          2    2

[2230 rows x 8 columns]

In [229]:
rock['release_year'].value_counts()

0       577
1973    104
1977     83
1975     83
1970     81
1971     75
1969     72
1980     70
1978     64
1979     63
1967     62
1981     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1985     39
1987     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1964     14
1992     14
1999     13
1995     10
1996      9
1997      9
1963      9
2002      6
1998      6
2005      5
2004      5
2012      5
2001      4
1962      3
2000      3
2011      3
2003      3
2008      3
2007      3
2013      2
2014      2
2006      1
1958      1
1071      1
1955      1
1961      1
Name: release_year, dtype: int64

In [230]:
# Create a mask to find all rows with 0, as the release year couldn't be min = 0
song_facts_mask = rock['release_year'] == 0
rock.loc[song_facts_mask, 'release_year'] = np.NaN
rock

                                       song_clean artist_clean  release_year                                           combined  first  year  playcount   fg
0                                Caught Up in You  .38 Special        1982.0                    Caught Up in You by .38 Special      1     1         82   82
1                                    Fantasy Girl  .38 Special           NaN                        Fantasy Girl by .38 Special      1     0          3    0
2                                 Hold On Loosely  .38 Special        1981.0                     Hold On Loosely by .38 Special      1     1         85   85
3                          Rockin' Into the Night  .38 Special        1980.0              Rockin' Into the Night by .38 Special      1     1         18   18
4                               Art For Arts Sake         10cc        1975.0                          Art For Arts Sake by 10cc      1     1          1    1
...                                           ...          ...           ...                                                ...    ...   ...        ...  ...
2225                      She Loves My Automobile       ZZ Top           NaN                  She Loves My Automobile by ZZ Top      1     0          1    0
2226                            Tube Snake Boogie       ZZ Top        1981.0                        Tube Snake Boogie by ZZ Top      1     1         32   32
2227                                         Tush       ZZ Top        1975.0                                     Tush by ZZ Top      1     1        109  109
2228                                   TV Dinners       ZZ Top        1983.0                               TV Dinners by ZZ Top      1     1          1    1
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO       ZZ Top        1973.0  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...      1     1          2    2

[2230 rows x 8 columns]

In [231]:
check_min_max(rock)

                 min     max
release_year  1071.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
fg               0.0   142.0

In [232]:
# Create a mask to find all rows with 0
song_facts_mask = rock['release_year'] == 1071
rock.loc[song_facts_mask, 'release_year'] = np.NaN

In [233]:
check_min_max(rock)

                 min     max
release_year  1955.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
fg               0.0   142.0

## Write Some Functions

In [235]:
rock.iloc[100]
def get_song_by_index(songID):
    return rock.iloc[songID]
get_song_by_index(2)

song_clean                     Hold On Loosely
artist_clean                       .38 Special
release_year                            1981.0
combined        Hold On Loosely by .38 Special
first                                        1
year                                         1
playcount                                   85
fg                                          85
Name: 2, dtype: object

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [253]:
condition = rock['release_year'] < 1970
rock['before_1970'] = condition

rock.before_1970 = rock.before_1970.map({True:'Yes',False:'No'})
rock

                                       song_clean artist_clean  release_year                                           combined  first  year  playcount   fg before_1970
0                                Caught Up in You  .38 Special        1982.0                    Caught Up in You by .38 Special      1     1         82   82          No
1                                    Fantasy Girl  .38 Special           NaN                        Fantasy Girl by .38 Special      1     0          3    0          No
2                                 Hold On Loosely  .38 Special        1981.0                     Hold On Loosely by .38 Special      1     1         85   85          No
3                          Rockin' Into the Night  .38 Special        1980.0              Rockin' Into the Night by .38 Special      1     1         18   18          No
4                               Art For Arts Sake         10cc        1975.0                          Art For Arts Sake by 10cc      1     1          1    1          No
...                                           ...          ...           ...                                                ...    ...   ...        ...  ...         ...
2225                      She Loves My Automobile       ZZ Top           NaN                  She Loves My Automobile by ZZ Top      1     0          1    0          No
2226                            Tube Snake Boogie       ZZ Top        1981.0                        Tube Snake Boogie by ZZ Top      1     1         32   32          No
2227                                         Tush       ZZ Top        1975.0                                     Tush by ZZ Top      1     1        109  109          No
2228                                   TV Dinners       ZZ Top        1983.0                               TV Dinners by ZZ Top      1     1          1    1          No
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO       ZZ Top        1973.0  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...      1     1          2    2          No

[2230 rows x 9 columns]

In [262]:
def check_song(songID):
    print('Song: ', rock.song_clean.iloc[songID])
    print('Artist: ', rock.artist_clean.iloc[songID])
    print('Release before 1970: ', rock.before_1970.iloc[songID])
    print('\n')
check_song(100)

Song:  One Way Out
Artist:  Allman Brothers Band
Release before 1970:  No

def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce')
    return column## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [ ]:
def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce')
    return column

## Apply these functions to your dataset

In [ ]:
rock.apply(convert_to_float)

rock.describe().T## Describe the new float-only DataFrame.

In [263]:
rock.describe()

       release_year   first         year    playcount           fg
count   1652.000000  2230.0  2230.000000  2230.000000  2230.000000
mean    1978.562349     1.0     0.741256    16.872646    15.048430
std        9.311312     0.0     0.438043    25.302972    25.288366
min     1955.000000     1.0     0.000000     0.000000     0.000000
25%     1971.000000     1.0     0.000000     1.000000     0.000000
50%     1977.000000     1.0     1.000000     4.000000     3.000000
75%     1984.000000     1.0     1.000000    21.000000    18.000000
max     2014.000000     1.0     1.000000   142.000000   142.000000

>



---



---



> > > > > > > > > © 2022 Institute of Data


---



---